const customerSteps = [
    {
        id: 1,
        title: 'Регистрация',
        description: [
            'Войдите в веб-сервис нажав на любую кнопку «войти в сервис» на этой странице.',
            'Регистрация производится только с помощью почты. На указанную почту придёт ссылка, по которой вы сможете войти в сервис.',
            'Далее заполните форму, выберете свою роль и нажмите продолжить.'
        ],
        images: [
            '/media/how-it-works/customer/login.png',
            '/media/how-it-works/customer/registration.png',
        ]
    },
    {
        id: 2,
        title: 'Создание заказа',
        description: [
            'В правом верхнем углу нажмите "создать заказ". Выберете необходимую работу, опишите объект, предпочитаемый способ связи и другие подробности. Если известен объем финансирования укажите стоимость, но это не обязательно.',
            'Каждую работу необходимо заносить как отдельный заказ.',
        ],
        images: [
            '/media/how-it-works/customer/create_order_2.png',
            '/media/how-it-works/customer/create_order_form_2.png',
        ]
    },
    {
        id: 3,
        title: 'Рассмотрение и оценка',
        description: [
            'Наш администратор рассмотрит Ваш заказ, выявит достаточность сведений и свяжется по предпочитаемому способу связи для уточнения деталей (при необходимости).',
            'После этого будет произведена оценка стоимости и сроков работы в эти же сутки.'
        ],
        images: [
            '/media/how-it-works/customer/waiting_order.png',
        ]
    },
    {
        id: 4,
        title: 'Заключение договора',
        description: [
            'Все работы оформляются юридически, и ответственность за выполнение фрилансерами работы лежит на нас.',
            'Оригинал договора отправляется почтой России.'
        ],
        images: [
            '/media/how-it-works/customer/contract.jpg'
        ]
    },
    {
        id: 5,
        title: 'Назначение менеджера',
        description: [
            'Для контроля работы со стороны исполнителя, мы назначаем менеджера.',
            'Весь контакт у Вас будет происходить именно с ним.'
        ],
        images: [
            '/media/how-it-works/customer/manager.png'
        ]
    },
    {
        id: 6,
        title: 'Подбор исполнителя',
        description: [
            'Менеджер производит релевантный подбор специалиста внутри сервиса. Учитываются следующие факторы: углубленный профиль; опыт работы в данном регионе; достаточность временных ресурсов для выполнения задачи.',
        ],
        images: [
            '/media/how-it-works/customer/waiting_executors.png',
            '/media/how-it-works/customer/mail2.png'
        ]
    },
    {
        id: 7,
        title: 'Выполнение работы',
        description: [
            'После принятия работы инженером-экологом, начинается работа по сбору всех необходимых исходных сведений посредством почты или месенджера. Все уведомления о смене этапа работы будут приходить Вам автоматически.',
            'Посмотреть на какой стадии находится проект, вы сможете в личном кабинете.'
        ],
        images: [
            '/media/how-it-works/customer/process_order2.png',
        ]
    },
    {
        id: 8,
        title: 'Прием работы',
        description: [
            'После проведения расчётов /составления описания/ согласования, итоговый пакет документов будет направлен удобным способом',
        ],
        images: [
            '/media/how-it-works/customer/complite.png'
        ]
    }
]

export default customerSteps