<script setup>

const faqItems = [
  {
    title: 'Каковы размеры штрафов по экологии?',
    body: 'В соответствии с главой 8 КоАП РФ, штрафы для индивидуальных предпринимателей могут достигать 50 000 рублей, а для юридических лиц 250 000 рублей в зависимости от статьи. Также инспектор вправе приостановить деятельность на 90 суток. Статья 8.41 "невнесение платы в срок" достаточно конкретная, в то же время статья 8.1 "несоблюдение экологических требований" обширная и может содержать нарушение попадающее под статью 8.5 "сокрытие или искажение экологической информации", которая имеет другой размер штрафа. Обращаясь к нашей компании за сопровождением проверок, вы найдете выгоду в таких деталях.',
    suffix: '1',
    isExpanded: 'true',
  },
  {
    title: 'Где посмотреть полный перечень экологических документов, которые должны быть на предприятии?',
    body: 'Все требования к наличию тех или иных документов раскиданы по федеральным законам и другим подзаконным актам. Ваш список будет зависеть от категории объекта негативного воздействия, от размера компании и специфики деятельности. Поэтому каждая организация будет иметь свой список. Вы можете позвонить нам и наш специалист вас сориентирует.',
    suffix: '2',
    isExpanded: 'false',
  },
  {
    title: 'Такие большие деньги отдавать за разработку и согласование. Не легче оплатить штраф?',
    body: 'Вы оплатите штраф и Вам выдадут предписание, по итогам которого, вам будет необходимо устранить недостаток и предоставить такие документы. Поэтому и в экологическом, и в финансовом отношении, согласование деятельности с государственными органами выгодное решение.',
    suffix: '3',
    isExpanded: 'false',
  },
  {
    title: 'У нас офис, нужно ли нам иметь экологическую документацию?',
    body: 'Да, нужно. В самом простом случае вы образуете мусор от офисных помещений, количество которого нужно декларировать. Но в офисе могут образовываться такие опасные отходы как ртутные лампы и т.д. А согласно постановлению правительств от 3 марта 2017 г. № 255 «Об исчислении и взимании платы за негативное воздействие на окружающую среду» плату нужно вносить всем компаниям и индивидуальным предпринимателям, вне зависимости от формы организации труда.',
    suffix: '4',
    isExpanded: 'false',
  },

  {
    title: 'У нас не было экологических проверок. Зачем нам такие документы?',
    body: 'В зависимости от категории объекта негативного воздействия определяется частота плановой проверки. Вдобавок к этому проверка может быть внеплановой, документарной и выездной. В любом из этих случаев надзорный орган рано или поздно посетит вас, к тому же отсутствие проверок не освобождает вас от ответственности. Поэтому если организация не стоит на учёте, не предоставляет своевременно отчёты и не имеет разрешительных документов на свою деятельность, на неё будет составлено административное, а в особых случаях, и уголовное правонарушение.',
    suffix: '5',
    isExpanded: 'false',
  },
]

</script>
<template>
  <section class="" id="FAQ">
    <div class="container-xxl d-flex flex-column justify-content-center py-10 pt-10 rounded">
      <h1 class="fs-2hx fw-bolder text-center mb-10">Часто задаваемые вопросы</h1>
      <div class="container rounded shadow-lg py-10">
        <div class="accordion" id="kt_accordion_1">
          <div class="accordion-item" v-for="item of faqItems" :key="item.suffix">
            <h2 class="accordion-header" :id="'kt_accordion_1_header_' + item.suffix">
              <button :class="'accordion-button fs-4 fw-bold' + (item.isExpanded === 'false' ? ' collapsed' : '')" type="button" data-bs-toggle="collapse"
                :data-bs-target="'#kt_accordion_1_body_' + item.suffix" :aria-expanded="item.isExpanded" :aria-controls="'kt_accordion_1_body_' + item.suffix">
                {{ item.title }}
              </button>
            </h2>
            <div :id="'kt_accordion_1_body_' + item.suffix" :class=" 'accordion-collapse collapse' + (item.isExpanded === 'true' ? ' show' : '') "
              :aria-labelledby="'kt_accordion_1_header_' + item.suffix" data-bs-parent="#kt_accordion_1">
              <div class="accordion-body">
                {{ item.body }}
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>